# FindFailureDefinition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionRegistry..::..FindFailureDefinition Method
FailureDefinitionRegistry Class See Also
---
Finds a specific FailureDefinition by a given FailureDefinitionId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureDefinitionAccessor FindFailureDefinition(
	FailureDefinitionId id
)
```

Visual Basic
---
```text
Public Function FindFailureDefinition ( _
	id As FailureDefinitionId _
) As FailureDefinitionAccessor
```

Visual C++
---
```text
public:
FailureDefinitionAccessor^ FindFailureDefinition(
	FailureDefinitionId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..FailureDefinitionId The id of the FailureDefinition.
# ### Return Value
The accessor of the found FailureDefinition, or null, if the FailureDefinition was not found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace